{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8e6ea841",
   "metadata": {},
   "source": [
    "# Set up for mock database of Process Hierarchy"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4443c326",
   "metadata": {},
   "source": [
    "## Simply press the run button to run cells"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "66c8644a",
   "metadata": {},
   "source": [
    "### Run this cell to ensure configuration is correct"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "ac95019e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "set notebook config to:\n",
      "{\n",
      "  \"host\": \"localhost\",\n",
      "  \"port\": 8182,\n",
      "  \"proxy_host\": \"\",\n",
      "  \"proxy_port\": 8182,\n",
      "  \"ssl\": false,\n",
      "  \"ssl_verify\": true,\n",
      "  \"sparql\": {\n",
      "    \"path\": \"\"\n",
      "  },\n",
      "  \"gremlin\": {\n",
      "    \"traversal_source\": \"g\",\n",
      "    \"username\": \"\",\n",
      "    \"password\": \"\",\n",
      "    \"message_serializer\": \"graphsonv3\"\n",
      "  },\n",
      "  \"neo4j\": {\n",
      "    \"username\": \"neo4j\",\n",
      "    \"password\": \"password\",\n",
      "    \"auth\": true,\n",
      "    \"database\": null\n",
      "  }\n",
      "}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<graph_notebook.configuration.generate_config.Configuration at 0x2211ddf2200>"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%graph_notebook_config\n",
    "{\n",
    "  \"host\": \"localhost\",\n",
    "  \"port\": 8182,\n",
    "  \"ssl\": false,\n",
    "  \"gremlin\": {\n",
    "    \"traversal_source\": \"g\",\n",
    "    \"username\": \"\",\n",
    "    \"password\": \"\",\n",
    "    \"message_serializer\": \"graphsonv3\"\n",
    "  }\n",
    "}"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "96e004e8",
   "metadata": {},
   "source": [
    "### This populates your database with mock data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "51872018",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "00aea5169bc94933b69f1929fea8148d",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.addV('hierarchy').property(id, 'lehigh').property('process', 'Lehigh').property(\"name\", 'process: lehigh').as('lehigh').\n",
    "  addV('stage').property(id, 'lehigh-1').property('stage', 'Lehigh-1').property('name', 'stage: lehigh-1').as('lehigh-1').\n",
    "  addV('operation').property(id, 'lehigh-1-1').property('operation', 'Lehigh-1-1').property('name', 'operation: lehigh-1-1').as('lehigh-1-1').\n",
    "  addV('action').property(id, 'lehigh-1-1-1').property('action', 'Lehigh-1-1-1').property('name', 'action: lehigh-1-1-1').as('lehigh-1-1-1').\n",
    "  addV('measure').property(id, 'lehigh-1-1-1-m1').property('measure', 'Lehigh-1-1-1-m1').property('name', 'measure: lehigh-1-1-1-m1').as('lehigh-1-1-1-m1').\n",
    "  addV('measure').property(id, 'lehigh-1-1-1-m2').property('measure', 'Lehigh-1-1-1-m2').property('name', 'measure: lehigh-1-1-1-m2').as('lehigh-1-1-1-m2').\n",
    "  addV('xpath').property(id, 'lehigh-1-1-1-m1-x1').property('name', 'xpath: //lehigh-1-1-1-m1//site1//x1').property('xpath','//lehigh-1-1-1-m1//site1//x1').property('measureID','lehigh-1-1-1-m1').property('site','Site-1').as('lehigh-1-1-1-m1-x1').\n",
    "  addV('xpath').property(id, 'lehigh-1-1-1-m1-x2').property('name', 'xpath: //lehigh-1-1-1-m1//site1//x2').property('xpath','//lehigh-1-1-1-m1//site1//x2').property('measureID','lehigh-1-1-1-m1').property('site','Site-2').as('lehigh-1-1-1-m1-x2').\n",
    "  addV('results').property(id, 'lehigh-1-1-1-m1-x1-res').property('name', 'results: //lehigh-1-1-1-m1//site1//x1').property('xpath','//lehigh-1-1-1-m1//site1//x1').property('materialNum','1').property('batchID','413242').property('site','Site-2').property('DOM','2022-03-13').property('result',98.29339).as('lehigh-1-1-1-m1-x1-res').\n",
    "  addV('results').property(id, 'lehigh-1-1-1-m1-x2-res').property('name', 'results: //lehigh-1-1-1-m1//site1//x2').property('xpath','//lehigh-1-1-1-m1//site1//x2').property('materialNum','1').property('batchID','434825').property('site','Site-2').property('DOM','2022-03-15').property('result',100.29339).as('lehigh-1-1-1-m1-x2-res').\n",
    "  addE(\"has\").from(\"lehigh\").to(\"lehigh-1\").\n",
    "addE(\"has\").from(\"lehigh-1\").to(\"lehigh-1-1\").\n",
    "addE(\"has\").from(\"lehigh-1-1\").to(\"lehigh-1-1-1\").\n",
    "addE(\"link\").from('lehigh-1-1-1-m1').to('lehigh-1-1-1-m1-x1').\n",
    "addE(\"link\").from('lehigh-1-1-1-m2').to('lehigh-1-1-1-m1-x2').\n",
    "addE(\"has\").from(\"lehigh-1-1-1\").to(\"lehigh-1-1-1-m1\").\n",
    "addE(\"has\").from(\"lehigh-1-1-1\").to(\"lehigh-1-1-1-m2\").\n",
    "addE(\"link\").from(\"lehigh-1-1-1-m1-x1\").to(\"lehigh-1-1-1-m1-x1-res\").\n",
    "addE(\"link\").from(\"lehigh-1-1-1-m1-x2\").to(\"lehigh-1-1-1-m1-x2-res\")\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "6b986ae9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "e0563b7414874e099a4d1cce3cdd7c1b",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "\n",
    "\n",
    "g.addE(\"link\").from(__.V('lehigh-1-1-1-m1')).to(__.V('lehigh-1-1-1-m1-x1')).\n",
    "  addE(\"link\").from(__.V('lehigh-1-1-1-m2')).to(__.V('lehigh-1-1-1-m1-x2'))\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1444b394",
   "metadata": {},
   "source": [
    "### # This query deletes all nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "1bbbd991",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "c6f8c8a237354e6dbf12e8bf69245f99",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.V().drop()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9289d046",
   "metadata": {},
   "source": [
    "## This is the query of for  traversing a specific hierarchy using the process name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "a028aa34",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "f74e596e635540f9974417d6b6f3eea8",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin -p v,oute,inv,oute,inv,oute,inv,oute,inv\n",
    "\n",
    "g.V('raw-mat4').outE().inV().outE().inV().outE().inV().outE().inV().path().by('name').by(label)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9e06e42f",
   "metadata": {},
   "source": [
    "## This is the query of for  traversing a specific hierarchy using the process name with the Xpath & results included for measures"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "afff6a3e",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "bd355081b1f541e1b1d0a89f519f02ca",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Force(network=<…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin -p v,oute,inv,oute,inv,oute,inv,oute,inv,oute,inv,oute,inv\n",
    "\n",
    "g.V('lehigh').outE().inV().outE().inV().outE().inV().outE().inV().outE().inV().outE().inV().path().by('name').by(label)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "043163d9",
   "metadata": {},
   "source": [
    "### Maps vertices to its value \"name\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "c0952d53",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "f967684d92114d258d3a9807ea80e93f",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V().valueMap('name')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "edeec669",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "09e4ea95b8744b38bca10d11d565baed",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(overflow='scroll')),), _titles={'0': 'Error'})"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%status"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
