{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8e6ea841",
   "metadata": {},
   "source": [
    "# Set up for mock database of Process Hierarchy"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4443c326",
   "metadata": {},
   "source": [
    "## Simply press the run button to run cells"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "66c8644a",
   "metadata": {},
   "source": [
    "### Run this cell to ensure configuration is correct"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "ac95019e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "set notebook config to:\n",
      "{\n",
      "  \"host\": \"localhost\",\n",
      "  \"port\": 8182,\n",
      "  \"proxy_host\": \"\",\n",
      "  \"proxy_port\": 8182,\n",
      "  \"ssl\": false,\n",
      "  \"ssl_verify\": true,\n",
      "  \"sparql\": {\n",
      "    \"path\": \"\"\n",
      "  },\n",
      "  \"gremlin\": {\n",
      "    \"traversal_source\": \"g\",\n",
      "    \"username\": \"\",\n",
      "    \"password\": \"\",\n",
      "    \"message_serializer\": \"graphsonv3\"\n",
      "  },\n",
      "  \"neo4j\": {\n",
      "    \"username\": \"neo4j\",\n",
      "    \"password\": \"password\",\n",
      "    \"auth\": true,\n",
      "    \"database\": null\n",
      "  }\n",
      "}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<graph_notebook.configuration.generate_config.Configuration at 0x1bd6c58c9a0>"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%graph_notebook_config\n",
    "{\n",
    "  \"host\": \"localhost\",\n",
    "  \"port\": 8182,\n",
    "  \"ssl\": false,\n",
    "  \"gremlin\": {\n",
    "    \"traversal_source\": \"g\",\n",
    "    \"username\": \"\",\n",
    "    \"password\": \"\",\n",
    "    \"message_serializer\": \"graphsonv3\"\n",
    "  }\n",
    "}"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "96e004e8",
   "metadata": {},
   "source": [
    "### This populates your database with mock data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "51872018",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "1ba6a3fb4fa14f978a82eb37635135b1",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.addV('hierarchy').property(id, 'lehigh').property('process', 'Lehigh').property(\"name\", 'process: lehigh').as('lehigh').\n",
    "  addV('stage').property(id, 'lehigh-1').property('stage', 'Lehigh-1').property('name', 'stage: lehigh-1').as('lehigh-1').\n",
    "  addV('operation').property(id, 'lehigh-1-1').property('operation', 'Lehigh-1-1').property('name', 'operation: lehigh-1-1').as('lehigh-1-1').\n",
    "  addV('action').property(id, 'lehigh-1-1-1').property('action', 'Lehigh-1-1-1').property('name', 'action: lehigh-1-1-1').as('lehigh-1-1-1').\n",
    "  addV('measure').property(id, 'lehigh-1-1-1-m1').property('measure', 'Lehigh-1-1-1-m1').property('name', 'measure: lehigh-1-1-1-m1').as('lehigh-1-1-1-m1').\n",
    "  addV('measure').property(id, 'lehigh-1-1-1-m2').property('measure', 'Lehigh-1-1-1-m2').property('name', 'measure: lehigh-1-1-1-m2').as('lehigh-1-1-1-m2').\n",
    "  addV('xpath').property(id, 'lehigh-1-1-1-m1-x1').property('name', 'xpath: //lehigh-1-1-1-m1//site1//x1').property('xpath','//lehigh-1-1-1-m1//site1//x1').property('measureID','lehigh-1-1-1-m1').property('site','Site-1').as('lehigh-1-1-1-m1-x1').\n",
    "  addV('xpath').property(id, 'lehigh-1-1-1-m1-x2').property('name', 'xpath: //lehigh-1-1-1-m1//site1//x2').property('xpath','//lehigh-1-1-1-m1//site1//x2').property('measureID','lehigh-1-1-1-m1').property('site','Site-2').as('lehigh-1-1-1-m1-x2').\n",
    "  addV('results').property(id, 'lehigh-1-1-1-m1-x1-res').property('name', 'results: //lehigh-1-1-1-m1//site1//x1').property('xpath','//lehigh-1-1-1-m1//site1//x1').property('materialNum','1').property('batchID','413242').property('site','Site-2').property('DOM','2022-03-13').property('result',98.29339).as('lehigh-1-1-1-m1-x1-res').\n",
    "  addV('results').property(id, 'lehigh-1-1-1-m1-x2-res').property('name', 'results: //lehigh-1-1-1-m1//site1//x2').property('xpath','//lehigh-1-1-1-m1//site1//x2').property('materialNum','1').property('batchID','434825').property('site','Site-2').property('DOM','2022-03-15').property('result',100.29339).as('lehigh-1-1-1-m1-x2-res').\n",
    "  addE(\"has\").from(\"lehigh\").to(\"lehigh-1\").\n",
    "addE(\"has\").from(\"lehigh-1\").to(\"lehigh-1-1\").\n",
    "addE(\"has\").from(\"lehigh-1-1\").to(\"lehigh-1-1-1\").\n",
    "addE(\"link\").from('lehigh-1-1-1-m1').to('lehigh-1-1-1-m1-x1').\n",
    "addE(\"link\").from('lehigh-1-1-1-m2').to('lehigh-1-1-1-m1-x2').\n",
    "addE(\"has\").from(\"lehigh-1-1-1\").to(\"lehigh-1-1-1-m1\").\n",
    "addE(\"has\").from(\"lehigh-1-1-1\").to(\"lehigh-1-1-1-m2\").\n",
    "addE(\"link\").from(\"lehigh-1-1-1-m1-x1\").to(\"lehigh-1-1-1-m1-x1-res\").\n",
    "addE(\"link\").from(\"lehigh-1-1-1-m1-x2\").to(\"lehigh-1-1-1-m1-x2-res\")\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "6b986ae9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "e0563b7414874e099a4d1cce3cdd7c1b",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "\n",
    "\n",
    "g.addE(\"link\").from(__.V('lehigh-1-1-1-m1')).to(__.V('lehigh-1-1-1-m1-x1')).\n",
    "  addE(\"link\").from(__.V('lehigh-1-1-1-m2')).to(__.V('lehigh-1-1-1-m1-x2'))\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f3cc5f5e",
   "metadata": {},
   "source": [
    "# Queries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "496a507e",
   "metadata": {},
   "source": [
    "## Find all vertices in the graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "4585e338",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "c467289dade44694804e97632f3136fc",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin \n",
    "\n",
    "g.V()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1444b394",
   "metadata": {},
   "source": [
    "## This query deletes all nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "id": "1bbbd991",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "4b718f2061984d5e89d11fa696362b43",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.V().drop()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "17f0819f",
   "metadata": {},
   "source": [
    "## This finds all the results of a given process"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "ad6d972d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "4be11faa40e74e2d8f15d7ae322ac602",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Force(network=<…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.V(\"lehigh6852253371\").repeat(out()).until(hasLabel(\"result\")).valueMap(true)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6f79861a",
   "metadata": {},
   "source": [
    "## This query finds a specific measureId from a process"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "ac926532",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "315a630cc1e8471fb0b458254b2386a7",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.V(\"test8035322371\").repeat(out(\"has\")).until(has(\"measureId\",\"test-5-1-1-M1\" )).toList()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f2ea99f5",
   "metadata": {},
   "source": [
    "## Finds the output of a specific hierarchy"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "be23d25f",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "0c3f124849e04b97a2ec212240c919b9",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Force(network=<…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V('lehigh6852253371').out(\"outputs\").valueMap(true)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e4cc2d54",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.V('RawMat-25880397113').outE().inV().path().by('name').by(label)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0845ee64",
   "metadata": {},
   "source": [
    "### Querying Node by its ID"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "48e1d7ec",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "06f1308a0b764e5682cd33499143c508",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin \n",
    "// note you have to include L afterwards because it is a long\n",
    "g.V(1L)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9289d046",
   "metadata": {},
   "source": [
    "# This is the query of for  traversing a specific hierarchy using the process name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "a028aa34",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "6342400ce5dd4944be00e7d5b53b84a1",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Force(network=<…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin -p v,oute,inv,oute,inv,oute,inv\n",
    "\n",
    "g.V(\"lehigh6852253371\").outE().inV().outE().inV().outE().inV().path().by('name').by(label)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fdc09a99",
   "metadata": {},
   "source": [
    "## Finding the Inputs of a process"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "be10867e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "744aca21393e4eddbc8500ff81b2d430",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.V('help').properties('inputs')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3178b93b",
   "metadata": {},
   "source": [
    "## This query finds all the results for a given measureId in a given Process"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "664b2b87",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "6e2f7a9560c8416f947cdefd0b765205",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Force(network=<…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.V('blue0060132371').repeat(out()).until(has(\"measureId\", \"blue-1-1-M2\"))\n",
    ".out().valueMap(true)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0fcb0308",
   "metadata": {},
   "source": [
    "## Find all the materials(inputs) that went into a process, and find the processes results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "143d6258",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "dbc5b38a8ded485aa8167ecc62060ca0",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Force(network=<…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin -p v,ine,oute\n",
    "\n",
    "g.V('lehigh6852253371').in().repeat(out()).until(hasLabel(\"result\")).path().by('name').by(label)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b1096219",
   "metadata": {},
   "source": [
    "improved query complexity over SQL"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9e06e42f",
   "metadata": {},
   "source": [
    "## This is the query for  traversing a specific hierarchy using the process name with the Xpath & results included for measures"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "afff6a3e",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "64762c82053c45fda25dd441a2f87fbb",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Force(network=<…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin -p v,oute,inv,oute,inv,oute,inv,oute,inv,oute,inv\n",
    "\n",
    "g.V('lehigh6852253371').outE().inV().outE().inV().outE().inV().outE().inV().outE().inV().path().by('name').by(label)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2c621d84",
   "metadata": {},
   "source": [
    "## Finding the inputs of a process"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "id": "6175e498",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "c4bca4863b7f47b9a612fa1b7f7f6427",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.V().has(\"name\", \"f\").in()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "40cae79b",
   "metadata": {},
   "outputs": [],
   "source": [
    "%%gremlin\n",
    "\n",
    "g.V('help')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "043163d9",
   "metadata": {},
   "source": [
    "### Maps vertices to its value \"name\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "c0952d53",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "a1af142ab13b433ab3c18e5c6297a889",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(max_height='600px', max_width='940px', overflow='scroll')), Output(layout=L…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%%gremlin\n",
    "g.V().valueMap('name')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "edeec669",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "09e4ea95b8744b38bca10d11d565baed",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Tab(children=(Output(layout=Layout(overflow='scroll')),), _titles={'0': 'Error'})"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "%status"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
